PinguinoIDE/pinguino-bootloaders/p32/usb/v1.x/proc/p32mz2048ech144.h
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC19CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC19SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC19INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D21IS:2;
    unsigned AD1D21IP:3;
    unsigned :3;
    unsigned AD1D22IS:2;
    unsigned AD1D22IP:3;
    unsigned :3;
    unsigned AD1D23IS:2;
    unsigned AD1D23IP:3;
    unsigned :3;
    unsigned AD1D24IS:2;
    unsigned AD1D24IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC20bits_t;
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC20INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D25IS:2;
    unsigned AD1D25IP:3;
    unsigned :3;
    unsigned AD1D26IS:2;
    unsigned AD1D26IP:3;
    unsigned :3;
    unsigned AD1D27IS:2;
    unsigned AD1D27IP:3;
    unsigned :3;
    unsigned AD1D28IS:2;
    unsigned AD1D28IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC21bits_t;
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC21INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D29IS:2;
    unsigned AD1D29IP:3;
    unsigned :3;
    unsigned AD1D30IS:2;
    unsigned AD1D30IP:3;
    unsigned :3;
    unsigned AD1D31IS:2;
    unsigned AD1D31IP:3;
    unsigned :3;
    unsigned AD1D32IS:2;
    unsigned AD1D32IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC22INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D33IS:2;
    unsigned AD1D33IP:3;
    unsigned :3;
    unsigned AD1D34IS:2;
    unsigned AD1D34IP:3;
    unsigned :3;
    unsigned AD1D35IS:2;
    unsigned AD1D35IP:3;
    unsigned :3;
    unsigned AD1D36IS:2;
    unsigned AD1D36IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC23bits_t;
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC23INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D37IS:2;
    unsigned AD1D37IP:3;
    unsigned :3;
    unsigned AD1D38IS:2;
    unsigned AD1D38IP:3;
    unsigned :3;
    unsigned AD1D39IS:2;
    unsigned AD1D39IP:3;
    unsigned :3;
    unsigned AD1D40IS:2;
    unsigned AD1D40IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC24INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D41IS:2;
    unsigned AD1D41IP:3;
    unsigned :3;
    unsigned AD1D42IS:2;
    unsigned AD1D42IP:3;
    unsigned :3;
    unsigned AD1D43IS:2;
    unsigned AD1D43IP:3;
    unsigned :3;
    unsigned AD1D44IS:2;
    unsigned AD1D44IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC25INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CPCIS:2;
    unsigned CPCIP:3;
    unsigned :3;
    unsigned CFDCIS:2;
    unsigned CFDCIP:3;
    unsigned :3;
    unsigned SBIS:2;
    unsigned SBIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC26bits_t;
extern volatile __IPC26bits_t IPC26bits __asm__ ("IPC26") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC26INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned SPI1EIS:2;
    unsigned SPI1EIP:3;
    unsigned :3;
    unsigned SPI1RXIS:2;
    unsigned SPI1RXIP:3;
    unsigned :3;
    unsigned SPI1TXIS:2;
    unsigned SPI1TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC27bits_t;
extern volatile __IPC27bits_t IPC27bits __asm__ ("IPC27") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC27INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC28 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned U1EIS:2;
    unsigned U1EIP:3;
    unsigned :3;
    unsigned U1RXIS:2;
    unsigned U1RXIP:3;
    unsigned :3;
    unsigned U1TXIS:2;
    unsigned U1TXIP:3;
    unsigned :3;
    unsigned I2C1BIS:2;
    unsigned I2C1BIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC28bits_t;
