PinguinoIDE/pinguino-bootloaders/p32/usb/v1.x/proc/p32mz2048ech144.h
#define _BF2DEVCFG1_FNOSC_POSITION               0x00000000
#define _BF2DEVCFG1_FNOSC_MASK                   0x00000007
#define _BF2DEVCFG1_FNOSC_LENGTH                 0x00000003

#define _BF2DEVCFG1_DMTINTV_POSITION             0x00000003
#define _BF2DEVCFG1_DMTINTV_MASK                 0x00000038
#define _BF2DEVCFG1_DMTINTV_LENGTH               0x00000003

#define _BF2DEVCFG1_FSOSCEN_POSITION             0x00000006
#define _BF2DEVCFG1_FSOSCEN_MASK                 0x00000040
#define _BF2DEVCFG1_FSOSCEN_LENGTH               0x00000001

#define _BF2DEVCFG1_IESO_POSITION                0x00000007
#define _BF2DEVCFG1_IESO_MASK                    0x00000080
#define _BF2DEVCFG1_IESO_LENGTH                  0x00000001

#define _BF2DEVCFG1_POSCMOD_POSITION             0x00000008
#define _BF2DEVCFG1_POSCMOD_MASK                 0x00000300
#define _BF2DEVCFG1_POSCMOD_LENGTH               0x00000002

#define _BF2DEVCFG1_OSCIOFNC_POSITION            0x0000000A
#define _BF2DEVCFG1_OSCIOFNC_MASK                0x00000400
#define _BF2DEVCFG1_OSCIOFNC_LENGTH              0x00000001

#define _BF2DEVCFG1_FCKSM_POSITION               0x0000000E
#define _BF2DEVCFG1_FCKSM_MASK                   0x0000C000
#define _BF2DEVCFG1_FCKSM_LENGTH                 0x00000002

#define _BF2DEVCFG1_WDTPS_POSITION               0x00000010
#define _BF2DEVCFG1_WDTPS_MASK                   0x001F0000
#define _BF2DEVCFG1_WDTPS_LENGTH                 0x00000005

#define _BF2DEVCFG1_WDTSPGM_POSITION             0x00000015
#define _BF2DEVCFG1_WDTSPGM_MASK                 0x00200000
#define _BF2DEVCFG1_WDTSPGM_LENGTH               0x00000001

#define _BF2DEVCFG1_WINDIS_POSITION              0x00000016
#define _BF2DEVCFG1_WINDIS_MASK                  0x00400000
#define _BF2DEVCFG1_WINDIS_LENGTH                0x00000001

#define _BF2DEVCFG1_FWDTEN_POSITION              0x00000017
#define _BF2DEVCFG1_FWDTEN_MASK                  0x00800000
#define _BF2DEVCFG1_FWDTEN_LENGTH                0x00000001

#define _BF2DEVCFG1_FWDTWINSZ_POSITION           0x00000018
#define _BF2DEVCFG1_FWDTWINSZ_MASK               0x03000000
#define _BF2DEVCFG1_FWDTWINSZ_LENGTH             0x00000002

#define _BF2DEVCFG1_DMTCNT_POSITION              0x0000001A
#define _BF2DEVCFG1_DMTCNT_MASK                  0x7C000000
#define _BF2DEVCFG1_DMTCNT_LENGTH                0x00000005

#define _BF2DEVCFG1_FDMTEN_POSITION              0x0000001F
#define _BF2DEVCFG1_FDMTEN_MASK                  0x80000000
#define _BF2DEVCFG1_FDMTEN_LENGTH                0x00000001

#define _BF2DEVCFG1_w_POSITION                   0x00000000
#define _BF2DEVCFG1_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG1_w_LENGTH                     0x00000020

#define _BF2DEVCFG0_DEBUG_POSITION               0x00000000
#define _BF2DEVCFG0_DEBUG_MASK                   0x00000003
#define _BF2DEVCFG0_DEBUG_LENGTH                 0x00000002

#define _BF2DEVCFG0_JTAGEN_POSITION              0x00000002
#define _BF2DEVCFG0_JTAGEN_MASK                  0x00000004
#define _BF2DEVCFG0_JTAGEN_LENGTH                0x00000001

#define _BF2DEVCFG0_ICESEL_POSITION              0x00000003
#define _BF2DEVCFG0_ICESEL_MASK                  0x00000018
#define _BF2DEVCFG0_ICESEL_LENGTH                0x00000002

#define _BF2DEVCFG0_TRCEN_POSITION               0x00000005
#define _BF2DEVCFG0_TRCEN_MASK                   0x00000020
#define _BF2DEVCFG0_TRCEN_LENGTH                 0x00000001

#define _BF2DEVCFG0_BOOTISA_POSITION             0x00000006
#define _BF2DEVCFG0_BOOTISA_MASK                 0x00000040
#define _BF2DEVCFG0_BOOTISA_LENGTH               0x00000001

#define _BF2DEVCFG0_FECCCON_POSITION             0x00000008
#define _BF2DEVCFG0_FECCCON_MASK                 0x00000300
#define _BF2DEVCFG0_FECCCON_LENGTH               0x00000002

#define _BF2DEVCFG0_FSLEEP_POSITION              0x0000000A
#define _BF2DEVCFG0_FSLEEP_MASK                  0x00000400
#define _BF2DEVCFG0_FSLEEP_LENGTH                0x00000001

#define _BF2DEVCFG0_DBGPER_POSITION              0x0000000C
#define _BF2DEVCFG0_DBGPER_MASK                  0x00007000
#define _BF2DEVCFG0_DBGPER_LENGTH                0x00000003

#define _BF2DEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _BF2DEVCFG0_EJTAGBEN_MASK                0x40000000
#define _BF2DEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _BF2DEVCFG0_FDEBUG_POSITION              0x00000000
#define _BF2DEVCFG0_FDEBUG_MASK                  0x00000003
#define _BF2DEVCFG0_FDEBUG_LENGTH                0x00000002

#define _BF2DEVCFG0_w_POSITION                   0x00000000
#define _BF2DEVCFG0_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG0_w_LENGTH                     0x00000020

#define _BF2DEVCP0_CP_POSITION                   0x0000001C
#define _BF2DEVCP0_CP_MASK                       0x10000000
#define _BF2DEVCP0_CP_LENGTH                     0x00000001

#define _BF2DEVCP0_w_POSITION                    0x00000000
#define _BF2DEVCP0_w_MASK                        0xFFFFFFFF
#define _BF2DEVCP0_w_LENGTH                      0x00000020

#define _BF2SEQ0_TSEQ_POSITION                   0x00000000
#define _BF2SEQ0_TSEQ_MASK                       0x0000FFFF
#define _BF2SEQ0_TSEQ_LENGTH                     0x00000010

#define _BF2SEQ0_CSEQ_POSITION                   0x00000010
#define _BF2SEQ0_CSEQ_MASK                       0xFFFF0000
#define _BF2SEQ0_CSEQ_LENGTH                     0x00000010

#define _BF2SEQ0_w_POSITION                      0x00000000
#define _BF2SEQ0_w_MASK                          0xFFFFFFFF
#define _BF2SEQ0_w_LENGTH                        0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _TIMER_1_VECTOR                          4
#define _INPUT_CAPTURE_1_ERROR_VECTOR            5
#define _INPUT_CAPTURE_1_VECTOR                  6
#define _OUTPUT_COMPARE_1_VECTOR                 7
#define _EXTERNAL_1_VECTOR                       8
#define _TIMER_2_VECTOR                          9
#define _INPUT_CAPTURE_2_ERROR_VECTOR            10
#define _INPUT_CAPTURE_2_VECTOR                  11
#define _OUTPUT_COMPARE_2_VECTOR                 12
#define _EXTERNAL_2_VECTOR                       13
#define _TIMER_3_VECTOR                          14
#define _INPUT_CAPTURE_3_ERROR_VECTOR            15
#define _INPUT_CAPTURE_3_VECTOR                  16
#define _OUTPUT_COMPARE_3_VECTOR                 17
#define _EXTERNAL_3_VECTOR                       18
#define _TIMER_4_VECTOR                          19
#define _INPUT_CAPTURE_4_ERROR_VECTOR            20
#define _INPUT_CAPTURE_4_VECTOR                  21
#define _OUTPUT_COMPARE_4_VECTOR                 22
#define _EXTERNAL_4_VECTOR                       23
#define _TIMER_5_VECTOR                          24
#define _INPUT_CAPTURE_5_ERROR_VECTOR            25
#define _INPUT_CAPTURE_5_VECTOR                  26
#define _OUTPUT_COMPARE_5_VECTOR                 27
#define _TIMER_6_VECTOR                          28
#define _INPUT_CAPTURE_6_ERROR_VECTOR            29
#define _INPUT_CAPTURE_6_VECTOR                  30
#define _OUTPUT_COMPARE_6_VECTOR                 31
#define _TIMER_7_VECTOR                          32
#define _INPUT_CAPTURE_7_ERROR_VECTOR            33
#define _INPUT_CAPTURE_7_VECTOR                  34
#define _OUTPUT_COMPARE_7_VECTOR                 35
#define _TIMER_8_VECTOR                          36
#define _INPUT_CAPTURE_8_ERROR_VECTOR            37
#define _INPUT_CAPTURE_8_VECTOR                  38
#define _OUTPUT_COMPARE_8_VECTOR                 39
#define _TIMER_9_VECTOR                          40
#define _INPUT_CAPTURE_9_ERROR_VECTOR            41
#define _INPUT_CAPTURE_9_VECTOR                  42
#define _OUTPUT_COMPARE_9_VECTOR                 43
#define _ADC1_VECTOR                             44
#define _ADC1_DC1_VECTOR                         46
#define _ADC1_DC2_VECTOR                         47
#define _ADC1_DC3_VECTOR                         48
#define _ADC1_DC4_VECTOR                         49
#define _ADC1_DC5_VECTOR                         50
#define _ADC1_DC6_VECTOR                         51
#define _ADC1_DF1_VECTOR                         52
#define _ADC1_DF2_VECTOR                         53
#define _ADC1_DF3_VECTOR                         54
#define _ADC1_DF4_VECTOR                         55
#define _ADC1_DF5_VECTOR                         56
#define _ADC1_DF6_VECTOR                         57
#define _ADC1_DATA0_VECTOR                       59
#define _ADC1_DATA1_VECTOR                       60
#define _ADC1_DATA2_VECTOR                       61
#define _ADC1_DATA3_VECTOR                       62
#define _ADC1_DATA4_VECTOR                       63
#define _ADC1_DATA5_VECTOR                       64
#define _ADC1_DATA6_VECTOR                       65
#define _ADC1_DATA7_VECTOR                       66
#define _ADC1_DATA8_VECTOR                       67
#define _ADC1_DATA9_VECTOR                       68
#define _ADC1_DATA10_VECTOR                      69
#define _ADC1_DATA11_VECTOR                      70
#define _ADC1_DATA12_VECTOR                      71
#define _ADC1_DATA13_VECTOR                      72
#define _ADC1_DATA14_VECTOR                      73
#define _ADC1_DATA15_VECTOR                      74
#define _ADC1_DATA16_VECTOR                      75
#define _ADC1_DATA17_VECTOR                      76
#define _ADC1_DATA18_VECTOR                      77
#define _ADC1_DATA19_VECTOR                      78
#define _ADC1_DATA20_VECTOR                      79
#define _ADC1_DATA21_VECTOR                      80
#define _ADC1_DATA22_VECTOR                      81
#define _ADC1_DATA23_VECTOR                      82
#define _ADC1_DATA24_VECTOR                      83
#define _ADC1_DATA25_VECTOR                      84
#define _ADC1_DATA26_VECTOR                      85
#define _ADC1_DATA27_VECTOR                      86
#define _ADC1_DATA28_VECTOR                      87
#define _ADC1_DATA29_VECTOR                      88
#define _ADC1_DATA30_VECTOR                      89
#define _ADC1_DATA31_VECTOR                      90
#define _ADC1_DATA32_VECTOR                      91
#define _ADC1_DATA33_VECTOR                      92
#define _ADC1_DATA34_VECTOR                      93
#define _ADC1_DATA35_VECTOR                      94
#define _ADC1_DATA36_VECTOR                      95
#define _ADC1_DATA37_VECTOR                      96
#define _ADC1_DATA38_VECTOR                      97
#define _ADC1_DATA39_VECTOR                      98
#define _ADC1_DATA40_VECTOR                      99
#define _ADC1_DATA41_VECTOR                      100
#define _ADC1_DATA42_VECTOR                      101
#define _ADC1_DATA43_VECTOR                      102
#define _ADC1_DATA44_VECTOR                      103
#define _CORE_PERF_COUNT_VECTOR                  104
#define _CORE_FAST_DEBUG_CHAN_VECTOR             105
#define _SYSTEM_BUS_PROTECTION_VECTOR            106
#define _SPI1_FAULT_VECTOR                       109
#define _SPI1_RX_VECTOR                          110
#define _SPI1_TX_VECTOR                          111
#define _UART1_FAULT_VECTOR                      112
#define _UART1_RX_VECTOR                         113
#define _UART1_TX_VECTOR                         114
#define _I2C1_BUS_VECTOR                         115
#define _I2C1_SLAVE_VECTOR                       116
#define _I2C1_MASTER_VECTOR                      117
#define _CHANGE_NOTICE_A_VECTOR                  118
#define _CHANGE_NOTICE_B_VECTOR                  119
#define _CHANGE_NOTICE_C_VECTOR                  120
#define _CHANGE_NOTICE_D_VECTOR                  121
#define _CHANGE_NOTICE_E_VECTOR                  122
#define _CHANGE_NOTICE_F_VECTOR                  123
#define _CHANGE_NOTICE_G_VECTOR                  124
#define _CHANGE_NOTICE_H_VECTOR                  125
#define _CHANGE_NOTICE_J_VECTOR                  126
#define _CHANGE_NOTICE_K_VECTOR                  127
#define _PMP_VECTOR                              128
#define _PMP_ERROR_VECTOR                        129
#define _COMPARATOR_1_VECTOR                     130
#define _COMPARATOR_2_VECTOR                     131
#define _USB_VECTOR                              132
#define _USB_DMA_VECTOR                          133
#define _DMA0_VECTOR                             134
#define _DMA1_VECTOR                             135
#define _DMA2_VECTOR                             136
#define _DMA3_VECTOR                             137
#define _DMA4_VECTOR                             138
#define _DMA5_VECTOR                             139
#define _DMA6_VECTOR                             140
#define _DMA7_VECTOR                             141
#define _SPI2_FAULT_VECTOR                       142
#define _SPI2_RX_VECTOR                          143
#define _SPI2_TX_VECTOR                          144
#define _UART2_FAULT_VECTOR                      145
#define _UART2_RX_VECTOR                         146
#define _UART2_TX_VECTOR                         147
#define _I2C2_BUS_VECTOR                         148
#define _I2C2_SLAVE_VECTOR                       149
#define _I2C2_MASTER_VECTOR                      150
#define _CAN1_VECTOR                             151
#define _CAN2_VECTOR                             152
#define _ETHERNET_VECTOR                         153
#define _SPI3_FAULT_VECTOR                       154
#define _SPI3_RX_VECTOR                          155
#define _SPI3_TX_VECTOR                          156
#define _UART3_FAULT_VECTOR                      157
#define _UART3_RX_VECTOR                         158
#define _UART3_TX_VECTOR                         159
#define _I2C3_BUS_VECTOR                         160
#define _I2C3_SLAVE_VECTOR                       161
#define _I2C3_MASTER_VECTOR                      162
#define _SPI4_FAULT_VECTOR                       163
#define _SPI4_RX_VECTOR                          164
#define _SPI4_TX_VECTOR                          165
#define _RTCC_VECTOR                             166
#define _FLASH_CONTROL_VECTOR                    167
#define _PREFETCH_VECTOR                         168
#define _SQI1_VECTOR                             169
#define _UART4_FAULT_VECTOR                      170
#define _UART4_RX_VECTOR                         171
#define _UART4_TX_VECTOR                         172
#define _I2C4_BUS_VECTOR                         173
#define _I2C4_SLAVE_VECTOR                       174
#define _I2C4_MASTER_VECTOR                      175
#define _SPI5_FAULT_VECTOR                       176
#define _SPI5_RX_VECTOR                          177
#define _SPI5_TX_VECTOR                          178
#define _UART5_FAULT_VECTOR                      179
#define _UART5_RX_VECTOR                         180
#define _UART5_TX_VECTOR                         181
#define _I2C5_BUS_VECTOR                         182
#define _I2C5_SLAVE_VECTOR                       183
#define _I2C5_MASTER_VECTOR                      184
#define _SPI6_FAULT_VECTOR                       185
#define _SPI6_RX_VECTOR                          186
#define _SPI6_TX_VECTOR                          187
#define _UART6_FAULT_VECTOR                      188
#define _UART6_RX_VECTOR                         189
#define _UART6_TX_VECTOR                         190

/*  The following device macros are predefined by the MPLAB XC32
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MZ2048ECH144
#  define __32MZ2048ECH144 1
#endif
#ifndef __32MZ2048ECH144__
#  define __32MZ2048ECH144__ 1
#endif
#ifndef __PIC32MZ
#  define __PIC32MZ 1
#endif
#ifndef __PIC32MZ__
#  define __PIC32MZ__ 1
#endif
#ifndef __PIC32_FLASH_SIZE
#  define __PIC32_FLASH_SIZE 2048
#endif
#ifndef __PIC32_FEATURE_SET
#  define __PIC32_FEATURE_SET "EC"
#endif
#ifndef __PIC32_FEATURE_SET__
#  define __PIC32_FEATURE_SET__ "EC"
#endif
#ifndef __PIC32_FEATURE_SET0
#  define __PIC32_FEATURE_SET0 'E'
#endif
#ifndef __PIC32_FEATURE_SET1
#  define __PIC32_FEATURE_SET1 'C'
#endif
#ifndef __PIC32_PRODUCT_GROUP
#  define __PIC32_PRODUCT_GROUP 'H'
#endif
#ifndef __PIC32_PIN_COUNT
#  define __PIC32_PIN_COUNT 144
#endif

/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_L1CACHE
# define __PIC32_HAS_L1CACHE 1
#endif
#ifndef __PIC32_HAS_MIPS32R2
# define __PIC32_HAS_MIPS32R2 1
#endif
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_DSPR2
# define __PIC32_HAS_DSPR2 1
#endif

#endif
